# Арифметический операции

num1 = 10
num2 = 20

# + - сложение
num3 = num1 + num2

# - - вычитание
num4 = num1 - num2

# * - умножение
num5 = num1 * num2

# / - деление
# // - целая часть от деления
# % - остаток от деления
num6 = 20 // 3 # 6
num7 = 49 //5 # 9
num8 = 21 // 4 # 5

num9 = 20 % 3 # 2
num10 = 49 % 5 # 4
num11 = 36 % 5 # 1

# Деление отрицательных чисел
num12 = -36 % 5 # 4 (остаток не может быть отрицательным, -36 = 5 * 8 + 4)

# ** - возведеиние в степень
num13 = 4 ** 2 # 16
num14 = 4 ** 0.5 # 2 (квадратный корень)