# Методы отбработки строк
# Методы не изменяют сам объект, а работают с их копией
data = "Hello World!"

# Замена всех вхождений подстроки old на подстроку new
data1 = data.replace('l', '1')

# Замена count (в данном случие 2) вхождений подстроки old на подстроку new
data2 = data.replace('l', '1', 2)

# Удаление всех пробельных символов в начале и в конце строки
# Пробельные символы - пробел, tab, \n
data3 = data.strip()

# Удаление всех указанные символы в начале и в конце строки
data4 = data.strip('*#')

# Удаление всех пробельных символов только в начале строки
data5 = data.lstrip()

# Удаление всех пробельных символов только в конце строки
data6 = data.rstrip()

# Раздениение строки на подстроки по пробелу, возращает список
data7 = data.split()

# Раздениение строки на подстроки по заданной подстроке, возращение списка
data8 = data.split('ll')

# Возвращение кол-во вхоэдений подстроки в строку
cnt = data.count('l')

print(data)

# Срезы
# Стандартная нумерация любой строки - слева направо от 0
# Обратная нумерация любой строки - справа налево от -1

data = 'Hello World!'
print(data[0:5]) # Срез с 0 по 5 позицию невключительно (Hello)
print(data[:5]) # Срез от начала строки до 5 позиции невключительно
print(data[5:]) # Срез c 5 позиции до конца строки
print(data[6:11]) # World == print(data[6:-1]) == print(data[-6:-1])

print(data[::2]) # Срез от начала до конца с шагом 2
print(data[::-1]) # Каждый первый символ с конца строки до начала
