# Условный оператор

# Порядок выполнения операций в Python
# 1. ()
# 2. **
# 3. *, /, //,%
# 4. +, -
# 5. <, >, <=,>=, ==, !=
# 6. not (инверсия, логическое отрицание)
# 7. and (конъюнкция, логическое умножение)
# 8. or (дзъюнкция, логическое сложение)

# Тернарный оператор
a = 5
if a % 2 == 0:
    print("Делится")
else:
    print('Не делиться')

print("Делится" if a % 2 == 0 else 'Не делиться')

###################################

num = int(input())

if num > 0:
    print('+')
elif num < 0:
    print('-')
else:
    print('0')

##################################

age = int(input())

if 0 <= age < 7:
    print('Дошкольник')
elif 7 <= age < 18:
    print('Школьник')
elif 18 <= age < 22:
    print('Студент')
elif 22 <= age < 65:
    print('Рабочий')
elif age >= 65:
    print('Пенсионер')