# Переменная
num = 16
# = - оператор присваивания
num1, num2 = 0, 1 # Присваивание разные значение нескольким переменным
num3 = num4 = 5 # Присваивание одно значение  нескольким переменным

# SWAP - поменяться местами
num3, num4 = num4, num3

# Нотации - правила оформления названий переменных
# snake_case - client_age, age_of_client
# camelCase - clientAge, ageOfClient
# PascalCase - ClientAge, AgeOfClient
# Название не может начинаться с цифры

# Правила алфавита для названия переменных
# Можно использовать: a-z, A-Z, 0-9, _

